# Домашнее задание по первому семинару курса "Гибкие методологии (Agile, SCRUM, Канбан и другие)".

## Само задание

Вы находитесь в команде компании-разработчика, которую привлекли для реализации проекта по созданию мобильного приложения
для крупной логолистической компании. В рамках проекта Вам предстоит создать мобильное приложение, с помощью которого клиенты 
компании будут создавать заказы на перевозку грузов. У заказчика есть следующие требования:
* Рассчитать бюджет всего проекта в самом начале - это необходимо для корректного бюджетирования деятельности компании. Рассчитать бюджет можно примерно, оценка бюджета 
может уточняться по мере разработки;

* Заказчик готов учавствовать в процессе разработки;

* У заказчика есть идея, но нет чёткого представления, как сформировать техническое задание на разработку - он хочет обсудить это с Вами.

Проанализируйте данный кейс и предложите наиболее подходящую модель разработки. Обоснуйте свои выводы.
